review-evidence/15-r1/reviews/R231-1/receipts/mutations/M6b-ubsan-only-reverted-empty/mutation.diff
diff -ru cand-pristine/cmake/CMakeGenTestingLibraries.cmake mut/M6b-ubsan-only-reverted-empty/cmake/CMakeGenTestingLibraries.cmake
--- cand-pristine/cmake/CMakeGenTestingLibraries.cmake	2026-09-22 09:21:04.000000000 +0200
+++ mut/M6b-ubsan-only-reverted-empty/cmake/CMakeGenTestingLibraries.cmake	2026-09-22 11:19:39.089046915 +0200
@@ -34,7 +34,6 @@
 		$<$<CONFIG:Release>:-O3 -g0 ${COMP_COVERAGE_FLAGS}>
 		$<$<CONFIG:MinSizeRel>:-Os -g0 ${COMP_COVERAGE_FLAGS}>
 		$<$<CONFIG:RelWithDebInfo>:-Os -g3 ${COMP_COVERAGE_FLAGS}>
-		${COMP_UBSAN_FLAGS}
 	)
 
 	target_include_directories(${BASENAME}_ubsan PUBLIC
